---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveByPointsArrayIterator
source: html/09aa015c-cc0c-299b-ee4d-3331bbe0a1ed.htm
---
# CurveByPointsArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.